# Volatility
# Copyright (C) 2007,2008 Volatile Systems
#
# Copyright (C) 2005,2006 4tphi Research
# Author: {npetroni,awalters}@4tphi.net (Nick Petroni and AAron Walters)
#
# This program is free software; you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation; either version 2 of the License, or (at
# your option) any later version.
#
# This program is distributed in the hope that it will be useful, but
# WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU
# General Public License for more details. 
#
# You should have received a copy of the GNU General Public License
# along with this program; if not, write to the Free Software
# Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA 02111-1307 USA 
#

"""
@author:       AAron Walters
@license:      GNU General Public License 2.0 or later
@contact:      awalters@volatilesystems.com
@organization: Volatile Systems
"""

#pylint: disable-msg=C0111

import sys
if __name__ == '__main__':
    sys.path.append(".")
    sys.path.append("..")

import re
import struct, copy, operator
import volatility.registry as MemoryRegistry
import volatility.addrspace as addrspace
import volatility.debug as debug
import volatility.conf as conf
config = conf.ConfObject()

class Curry:
    """ This class makes a curried object available for simple inlined functions.


                raise RuntimeError("Syntax Error in pointer type defintion for name {0}".format(name))
            
            return Curry(Pointer, None,
                         name = name,
                         target=self.list_to_type(name, target, typeDict))

        ## This is an array: [ 'array', count, ['foobar'] ]
        if typeList[0] == 'array':
            return Curry(Array, None,
                         name = name, count=typeList[1],
                         target=self.list_to_type(name, typeList[2], typeDict))

        ## This is a list which refers to a type which is already defined
        if typeList[0] in self.types:
            return Curry(self.types[typeList[0]], name=name)

        ## Does it refer to a type which will be defined in future? in
        ## this case we just curry the Object function to provide
        ## it on demand. This allows us to define structures
        ## recursively.
        ##if typeList[0] in typeDict:
        if 1:
            try:
                args = typeList[1]
            except IndexError:
                args = {}
            
            obj_name = typeList[0]
            return Curry(Object, obj_name, name=name, **args)

        ## If we get here we have no idea what this list is
        #raise RuntimeError("Error in parsing list {0}".format(typeList))
        print "Warning - Unable to find a type for {0}, assuming int".format(typeList[0])
        return Curry(self.types['int'], name=name)

    def get_obj_offset(self, name, member):
        """ Returns a members offset within the struct """
        class dummy:
            profile = self
        tmp = self.types[name](name, dummy())
        offset, _cls = tmp.members[member]
        
        return offset

    def get_obj_size(self, name):
        """Returns the size of a struct"""
        class dummy:
            profile = self
        tmp = self.types[name](name, dummy())
        return tmp.size()

    def apply_overlay(self, type_member, overlay):
        """ Update the overlay with the missing information from type.

        Basically if overlay has None in any slot it gets applied from vtype.
        """
        if not overlay:
            return type_member

        if type(type_member)==dict:
            for k, v in type_member.items():
                if k not in overlay:
                    overlay[k] = v
                else:
                    overlay[k] = self.apply_overlay(v, overlay[k])
                    
        elif type(overlay)==list:
            if len(overlay) != len(type_member):
                return overlay

            for i in range(len(overlay)):
                if overlay[i] == None:
                    overlay[i] = type_member[i]
                else:
                    overlay[i] = self.apply_overlay(type_member[i], overlay[i])

        return overlay
        
    def convert_members(self, cname, typeDict, overlay):
        """ Convert the member named by cname from the c description
        provided by typeDict into a list of members that can be used
        for later parsing.

        cname is the name of the struct.
        
        We expect typeDict[cname] to be a list of the following format

        [ Size of struct, members_dict ]

        members_dict is a dict of all members (fields) in this
        struct. The key is the member name, and the value is a list of
        this form:

        [ offset_from_start_of_struct, specification_list ]

        The specification list has the form specified by self.list_to_type() above.

        We return a list of CTypeMember objects. 
        """
        ctype = self.apply_overlay(typeDict[cname], overlay.get(cname))
        members = {}
        size = ctype[0]
        for k, v in ctype[1].items():
            if v[0] == None:
                print "Error - {0} has no offset in object {1}. Check that vtypes has a concrete definition for it.".format(k, cname)
            members[k] = (v[0], self.list_to_type(k, v[1], typeDict))

        ## Allow the plugins to over ride the class constructor here
        if MemoryRegistry.OBJECT_CLASSES and \
               cname in MemoryRegistry.OBJECT_CLASSES.objects:
            cls = MemoryRegistry.OBJECT_CLASSES[cname]
        else:
            cls = CType
        
        return Curry(cls, cls, members=members, size=size)

if __name__ == '__main__':
    ## If called directly we run unit tests on this stuff
    import unittest

    config.parse_options()
    MemoryRegistry.Init()

    class ObjectTests(unittest.TestCase):
        """ Tests the object implementation. """
        def test001ProxyObject(self):
            ## Check the proxying of various objects
            test_data = "hello world"
            address_space = addrspace.BufferAddressSpace(data=test_data)
            o = Object('String', offset=0, vm=address_space, length=len(test_data))
            
            print o.find("world"), o.upper(), o.lower()

            o = Object('unsigned int', offset=0, vm=address_space, length=len(test_data))
            O = o.v()
            print type(o), type(O)
            self.assertEqual(o, O)
            self.assertEqual(o + 5, O + 5)
            self.assertEqual(o + o, O + O)
            self.assertEqual(o * 2, O * 2)
            self.assertEqual(o * o, O * O)

            self.assertEqual(o > 5, O > 5)
            self.assertEqual(o < 1819043181, O < 1819043181)
            self.assertEqual(o <= 1819043181, O <= 1819043181)
            self.assertEqual(o == 1819043181, O == 1819043181)
            self.assertEqual(o < o, O < O)

            self.assertEqual(o / 4, O / 4)
            self.assertEqual(o << 2, O << 2)
            self.assertEqual(o >> 2, O >> 2)
            self.assertEqual(o / 3, O / 3)
            self.assertEqual(float(o), float(O))
            
            print o, o+5, o * 2, o / 2, o << 3, o & 0xFF, o + o

        def test01SimpleStructHandling(self):
            """ Test simple struct handling """
            mytype = {
                "HEADER": [ 0x20,
                            { 'MAGIC': [ 0x00, ['array', 3, ['char'] ]],
                              'Size': [ 0x04, ['unsigned int']],
                              'Count': [ 0x08, ['unsigned short int']],
                              }],
                }

            test_data = "ABAD\x06\x00\x00\x00\x02\x00\xff\xff"
            address_space = addrspace.BufferAddressSpace(data=test_data)
            address_space.profile.add_types(mytype)
            
            o = Object('HEADER', offset=0, vm=address_space)
            ## Can we decode ints?
            self.assertEqual(o.Size.v(), 6)
            self.assertEqual(int(o.Size), 6)
            self.assertEqual(o.Size + 6, 12)
            self.assertEqual(o.Size - 3, 3)
            self.assertEqual(o.Size + o.Count, 8)
            
            ## This demonstrates how array members print out
            print o.MAGIC[0], o.MAGIC[1]

            ## test comparison of array members
            self.assertEqual(o.MAGIC[0], 'A')
            self.assertEqual(o.MAGIC[0], o.MAGIC[2])
            self.assertEqual(o.MAGIC, ['A', 'B', 'A'])
            self.assertEqual(o.MAGIC, 'ABA')
            
            ## Iteration over arrays:
            tmp = 'ABA'
            count = 0
            for t in o.MAGIC:
                self.assertEqual(t, tmp[count])
                count += 1

        def test02Links(self):
            """ Tests intrastruct links, pointers etc """
            mytype = {
                '_LIST_ENTRY' : [ 0x8, { \
                      'Flink' : [ 0x0, ['pointer', ['_LIST_ENTRY']]], \
                      'Blink' : [ 0x4, ['pointer', ['_LIST_ENTRY']]], \
                      } ],
                '_HANDLE_TABLE' : [ 0x44, { \
                      'TableCode' : [ 0x0, ['unsigned long']], \
                      'UniqueProcessId' : [ 0x8, ['pointer', ['void']]], \
                      'HandleTableList' : [ 0x1c, ['_LIST_ENTRY']], \
                      'HandleCount' : [ 0x3c, ['long']], \
                      } ],
                }

            test_data = '\x01\x00\x00\x00\x00\x00\x00\x00\x1c\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\\\x00\x00\x00\\\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x02\x00\x00\x00\x03\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x1c\x00\x00\x00\x1c\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x05\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00'

            address_space = addrspace.BufferAddressSpace(data=test_data)
            address_space.profile.add_types(mytype)
            
            o = Object('_HANDLE_TABLE', offset=0, vm=address_space)

            self.assertEqual(o.TableCode, 1)
            self.assertEqual(o.UniqueProcessId, 0x1c)
            self.assertEqual(o.UniqueProcessId.dereference(), 0x5c)
            self.assertEqual(o.UniqueProcessId.dereference_as("unsigned int"), 0x5c)

            return
            n = o.HandleTableList.Flink
            self.assertEqual(n.TableCode, 3)
            self.assertEqual(n.HandleCount, 5)

            ## Make sure next.prev == o
            self.assertEqual(n.HandleTableList.Blink, o)
            self.assertEqual(n.HandleTableList.Blink.TableCode, 1)
                        
    suite = unittest.makeSuite(ObjectTests)
    res = unittest.TextTestRunner(verbosity=2).run(suite)
